# EndsNotOnCutFace Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..EndsNotOnCutFace Property
BuiltInFailures..::..SketchFailures Class See Also
---
Ends of the sketched loop do not lie on the boundary of the face being modified.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId EndsNotOnCutFace { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EndsNotOnCutFace As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ EndsNotOnCutFace {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace